39-Lab-Review-Pokemon-Teams/pokemon-teams-backend/app/controllers/pokemons_controller.rb

  def destroy
    render json: Pokemon.destroy(params[:id]).to_json(except: [:created_at, :updated_at])
---
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 5]]

  def create
    #find using Trainer.find
    #trainer.add_pokemon
    #render trainer as json
    num = Trainer.find(params[:trainer_id]).pokemons.length
    if(num < 6)
      pokemon = Pokemon.create(
        nickname: Faker::Name.first_name,
        species: Faker::Games::Pokemon.name,
        trainer_id: params[:trainer_id]
      )
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ? LIMIT ?  [["trainer_id", 1], ["LIMIT", 11]]
INSERT INTO "pokemons" ("species", "nickname", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", "Spearow"], ["nickname", "Jamison"], ["trainer_id", 2], ["created_at", "2020-06-10 16:27:46.529511"], ["updated_at", "2020-06-10 16:27:46.529511"]]