39-Lab-Review-Pokemon-Teams/pokemon-teams-backend/app/controllers/trainers_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
SELECT "trainers".* FROM "trainers"
---
  def index
      render json: Trainer.all.to_json(:include => :pokemons)